Repository: kallyas/ussd_emulator
Catalog: lib/l10n/app_*.arb
Languages: am, sw

# appTitle
source: USSD Emulator
am: የUSSD አስመሳይ
sw: Kijazo cha USSD

source: Initializing...
am: በመጀመር ላይ...
sw: Kuanzisha...

source: Config
am: ማቀናበሪያ
sw: Mipangilio

source: History
am: ታሪክ
sw: Historia

source: USSD Session
am: የUSSD ክፍለ ጊዜ
sw: Kipindi cha USSD

source: Configuration
am: ማቀናበሪያ
sw: Mipangilio

source: Session History
am: የክፍለ ጊዜ ታሪክ
sw: Historia ya Vipindi

source: Open accessibility settings
am: የተደራሽነት ቅንብሮችን ክፈት
sw: Fungua mipangilio ya ufikishaji

source: Configure accessibility options
am: የተደራሽነት አማራጮችን አስተካክል
sw: Sanidi chaguo za ufikishaji

source: Accessibility Settings
sw: Mipangilio ya Ufikishaji

# ussdSessionScreenTooltip
source: USSD Session Screen
am: የUSSD ክፍለ ጊዜ ማያ ገጽ
sw: Skrini ya Kipindi cha USSD

# endpointConfigurationTooltip
source: Endpoint Configuration
am: የመጨረሻ ነጥብ ማቀናበሪያ
sw: Usanidi wa Mwisho

# sessionHistoryTooltip
source: Session History
am: የክፍለ ጊዜ ታሪክ
sw: Historia ya Vipindi

# navigatedToScreen
source: Navigated to {screenName} screen
am: ወደ {screenName} ማያ ገጽ ተንቀሳቅሷል
sw: Imeelekea kwenye skrini ya {screenName}

source: Error
am: ስህተት
sw: Hitilafu

source: Dismiss error
am: ስህተቱን አስወግድ
sw: Ondoa hitilafu

source: Connected
am: ተገናኝቷል
sw: Imeunganishwa

source: End Session
am: ክፍለ ጊዜን አቁም
sw: Maliza Kipindi

source: USSD session ended.
am: የUSSD ክፍለ ጊዜ ተጠናቋል።
sw: Kipindi cha USSD kimemalizika.

source: Enter phone number
am: የስልክ ቁጥር አስገባ
sw: Ingiza nambari ya simu

# enterServiceCode
source: Enter service code like *123#
am: እንደ *123# ያለ የአገልግሎት ኮድ አስገባ
sw: Ingiza msimbo wa huduma kama *123#

source: Enter network code
am: የአውታረ መረብ ኮድ አስገባ
sw: Ingiza msimbo wa mtandao

source: Start Session
am: ክፍለ ጊዜ ጀምር
sw: Anza Kipindi

source: Session started
am: ክፍለ ጊዜ ተጀምሯል
sw: Kipindi kimeanza

source: Session ended
am: ክፍለ ጊዜ ተጠናቋል
sw: Kipindi kimemalizika

# networkError
source: Network connection failed. Please check your internet connection.
am: የአውታረ መረብ ግንኙነት ተሳክቶ አልተሳካም። እባክዎ የኢንተርኔት ግንኙነትዎን ይፈትሹ።
sw: Muunganisho wa mtandao umeshindwa. Tafadhali kagua muunganisho wako wa intaneti.

# invalidPhoneNumber
source: Invalid phone number format
am: ልክ ያልሆነ የስልክ ቁጥር አቀራረብ
sw: Muundo mbaya wa nambari ya simu

# sessionTimeout
source: Session timed out
am: ክፍለ ጊዜ ጊዜው አልፏል
sw: Kipindi kimepita

# phoneNumberHint
source: Enter phone number like +1234567890
am: እንደ +1234567890 ያለ የስልክ ቁጥር አስገባ
sw: Ingiza nambari ya simu kama +1234567890

# serviceCodeHint
source: Enter service code like *123#
am: እንደ *123# ያለ የአገልግሎት ኮድ አስገባ
sw: Ingiza msimbo wa huduma kama *123#

# networkCodeHint
source: Enter network code like MTN
am: እንደ MTN ያለ የአውታረ መረብ ኮድ አስገባ
sw: Ingiza msimbo wa mtandao kama MTN

source: Session Details
am: የክፍለ ጊዜ ዝርዝሮች
sw: Maelezo ya Kipindi

source: Language
am: ቋንቋ
sw: Lugha

source: Select Language
am: ቋንቋ ምረጥ
sw: Chagua Lugha

# languageChangedTo
source: Language changed to {languageName}
am: ቋንቋ ወደ {languageName} ተቀይሯል
sw: Lugha imebadilishwa kuwa {languageName}

source: English
am: እንግሊዝኛ
sw: Kiingereza

source: Swahili
am: ስዋሂሊ
sw: Kiswahili

source: French
am: ፈረንሳይኛ
sw: Kifaransa

source: Amharic
am: አማርኛ
sw: Kiamhara

source: Hausa
am: ሃውሳ
sw: Kihausa

source: Arabic
am: ዓረብኛ
sw: Kiarabu

source: No active session
am: ንቁ ክፍለ ጊዜ የለም
sw: Hakuna kipindi kilichoanza

# startNewSessionPrompt
source: Start a new USSD session to see conversation
am: ውይይቱን ለማየት አዲስ የUSSD ክፍለ ጊዜ ጀምር
sw: Anza kipindi kipya cha USSD kuona mazungumzo
